# завдання1
import pandas as pd

file_path = "zfpo_rivne_region.xlsx"
vievfile = pd.read_excel(file_path, sheet_name="Здобувачі")

print(vievfile.head(10))

print(vievfile.info())

#завдання2
#Загальна кількість здобувачів
all_students = vievfile["Здобувачів"].sum()
print(f"Загальна кількість здобувачів: {all_students}")

#Загальна кількість здобувачів за фінансуванням
count_students = vievfile.groupby("Фінансування")["Здобувачів"].sum()
print("\nКількість здобувачів за типом фінансування:")
print(count_students)

#Загальна кількість здобувачів за типом фінаннсування
count_degree = vievfile.groupby("Освітній ступінь")["Здобувачів"].sum()
print("\nКількість здобувачів за освітнім ступенем:")
print(count_degree)

#три  спеціальності які мають найбільшу кількість здобувачів.
top_specialties = vievfile.groupby("Спеціальність")["Здобувачів"].sum().nlargest(3)
print("\nТоп 3 спеціальності за кількістю здобувачів:")
print(top_specialties)

#Завдання 3
#фільтрація даних по  Фаховий молодший бакалавр
filtered = vievfile[vievfile["Освітній ступінь"] == "Фаховий молодший бакалавр"]
print("\nФільтрація даних по - Фаховий молодший бакалавр:")
print(filtered)

# Заклади, у яких кількість здобувачів більше 50 осіб
more_50 = vievfile[vievfile["Здобувачів"] > 50]
print("\nЗаклади, у яких кількість здобувачів більше 50:")
print(more_50[["Заклад освіти", "Здобувачів"]])

# Дані для закладів із типом фінансування "Контракт", де здобувачів більше 10
contract_more_10 = vievfile[(vievfile["Фінансування"] == "Контракт") & (vievfile["Здобувачів"] > 10)]
print("\nЗаклади з фінансуванням 'Контракт', де здобувачів більше 10:")
print(contract_more_10)

# Групування за спеціальністю та підрахунок загальної кількості здобувачів
count_specialty = vievfile.groupby("Спеціальність")["Здобувачів"].sum()
print("\nЗагальна кількість здобувачів за спеціальністю:")
print(count_specialty)

#завдання 4
#Створення нової колонки "Тип/Фінансування", яка поєднує значення колонок "Тип закладу освіти" та "Фінансування" через символ /.
vievfile["Тип/Фінансування"] = vievfile["Тип закладу освіти"] + "/" + vievfile["Фінансування"]

#Додавання колонки "Рентабельність", яка для контрактної форми обчислює умовну вартість навчання, помноживши кількість здобувачів на 17000.
vievfile["Рентабельність"] = vievfile["Здобувачів"] * 17000
vievfile.loc[vievfile["Фінансування"] != "Контракт", "Рентабельність"] = 0

#Збереження відфільтрованих даних (наприклад, за типом фінансування "Контракт") у новий Excel-файл.
vievfile_contract = vievfile[vievfile["Фінансування"] == "Контракт"]
vievfile_contract.to_excel("contract_students.xlsx", index=False)

#Збереження підсумкової таблиці з кількістю здобувачів за кожною спеціальністю у форматі CSV
specialty_summary = vievfile.groupby("Спеціальність")["Здобувачів"].sum()
specialty_summary.to_csv("specialty_summary.csv")

print("Збереження пройшол успішно, дані збережено у файли.")
